FabianB93/ardupilot/libraries/AP_HAL_ESP32/targets/esp32s3/esp-idf/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.1 Project Minimal Configuration
#

CONFIG_IDF_TARGET="esp32s3"

CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_BOOTLOADER_WDT_ENABLE=n

CONFIG_APP_COMPILE_TIME_DATE=n
CONFIG_APP_EXCLUDE_PROJECT_VER_VAR=y
CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR=y
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x10000

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_TWAI_ERRATA_FIX_LISTEN_ONLY_DOM=n
CONFIG_SPI_MASTER_IN_IRAM=y

CONFIG_ESP32S3_UNIVERSAL_MAC_ADDRESSES_TWO=y
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=n
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=n
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_ESP_IPC_TASK_STACK_SIZE=1536

# ----------------------------------------------------------------------
# WiFi
# ----------------------------------------------------------------------

CONFIG_ESP_WIFI_TASK_PINNED_TO_CORE_1=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
CONFIG_ESP_WIFI_GMAC_SUPPORT=n

# Reduce WiFi internal-RAM consumption.
#
# Default/current configuration used considerably more static buffers.
# This is important because camera + OpenH264 leave almost no internal
# heap available for WiFi/lwIP allocations.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16

CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=16

# Reduce BlockAck receive window to reduce WiFi memory requirements.
CONFIG_ESP_WIFI_RX_BA_WIN=6


# ----------------------------------------------------------------------
# FreeRTOS
# ----------------------------------------------------------------------

CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=10
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_ISR_STACKSIZE=2100
CONFIG_FREERTOS_CORETIMER_SYSTIMER_LVL3=y
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y


# ----------------------------------------------------------------------
# lwIP / networking
# ----------------------------------------------------------------------

CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU1=y


# ----------------------------------------------------------------------
# Driver compatibility / warnings
# ----------------------------------------------------------------------

CONFIG_ADC_SUPPRESS_DEPRECATE_WARN=y
CONFIG_ADC_CALI_SUPPRESS_DEPRECATE_WARN=y
CONFIG_MCPWM_SUPPRESS_DEPRECATE_WARN=y
CONFIG_RMT_SUPPRESS_DEPRECATE_WARN=y


# ----------------------------------------------------------------------
# esp32-camera
# ----------------------------------------------------------------------

# Keep camera processing away from ArduPilot's real-time tasks.
CONFIG_CAMERA_CORE1=y
CONFIG_CAMERA_TASK_STACK_SIZE=6144
CONFIG_CAMERA_TASK_PRIORITY=3

# OV2640 frame buffers and camera DMA use external PSRAM where possible.
CONFIG_CAMERA_PSRAM_DMA=y


# ----------------------------------------------------------------------
# External PSRAM - ESP32-S3-WROOM-1U-N16R8
# ----------------------------------------------------------------------

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y

# Small allocations up to 4 KiB prefer internal RAM.
# Larger generic allocations may use PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Keep 32 KiB internal RAM reserved for DMA/internal-capability allocations.
# Camera DMA requires this.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768